hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PDGO_H
#define HPM_PDGO_H

typedef struct {
    __W  uint32_t DGO_TURNOFF;                 /* 0x0: Trunoff Control Register */
    __RW uint32_t DGO_RC32K_CFG;               /* 0x4: RC32K CLOCK TRIM Register */
    __RW uint32_t DGO_CTRL;                    /* 0x8: Control Register */
    __R  uint8_t  RESERVED0[4];                /* 0xC - 0xF: Reserved */
    __RW uint32_t PIN_CTRL;                    /* 0x10: IO Control Register */
    __RW uint32_t PIN_STS;                     /* 0x14: IO Status Register */
    __RW uint32_t WAKEUP;                      /* 0x18: Wakeup Register */
    __RW uint32_t WKUP_CYC;                    /* 0x1C: Wakeup Cycle Register */
    __RW uint32_t WKUP_EN;                     /* 0x20: Wakeup Enable Register */
    __RW uint32_t WKUP_STS;                    /* 0x24: Wakeup Status Register */
    __R  uint8_t  RESERVED1[56];               /* 0x28 - 0x5F: Reserved */
    __RW uint32_t IRQ0_EN;                     /* 0x60: Interrupt 0 Enable Register */
    __RW uint32_t IRQ0_STS;                    /* 0x64: Interrupt 0 Status Register */
    __RW uint32_t IRQ1_EN;                     /* 0x68: Interrupt 1 Enable Register */
    __RW uint32_t IRQ1_STS;                    /* 0x6C: Interrupt 1 Status Register */
    __R  uint8_t  RESERVED2[16];               /* 0x70 - 0x7F: Reserved */
    __RW uint32_t GPR[8];                      /* 0x80 - 0x9C: General Purpose Register */
    __R  uint8_t  RESERVED3[96];               /* 0xA0 - 0xFF: Reserved */
    __RW uint32_t IOFILTER[4];                 /* 0x100 - 0x10C: WUIO Filter Register */
    __R  uint8_t  RESERVED4[240];              /* 0x110 - 0x1FF: Reserved */
    struct {
        __RW uint32_t CTRL;                    /* 0x200: Pulse Capture Control Register */
        __RW uint32_t CP_CFG;                  /* 0x204: Compare and  Period Configuration Register */
        __R  uint8_t  RESERVED0[8];            /* 0x208 - 0x20F: Reserved */
        __RW uint32_t COUNTER;                 /* 0x210: Counter Register */
        __RW uint32_t DUMP;                    /* 0x214: DUMP Register */
    } PCAP[1];
    __R  uint8_t  RESERVED5[104];              /* 0x218 - 0x27F: Reserved */
    struct {
        __RW uint32_t CNT_CFG;                 /* 0x280: Pulse Count Configuration Register */
        __RW uint32_t CALIB_CFG;               /* 0x284: Calibration Configuration Register */
        __RW uint32_t RESOLUTION;              /* 0x288: Resolution Configuration Register */
        __RW uint32_t HOMING_CFG;              /* 0x28C: Homing Configuration Register */
        __RW uint32_t ANALYSE_CFG;             /* 0x290: Analyse Configuration Register */
        __RW uint32_t DIRECTION;               /* 0x294: Direction Configuration Register */
        __RW uint32_t CMP0;                    /* 0x298: Compare0 Configuration Register */
        __RW uint32_t CMP1;                    /* 0x29C: Compare1 Configuration Register */
        __RW uint32_t CNT;                     /* 0x2A0: Counter Register */
        __RW uint32_t TACHO;                   /* 0x2A4: Tacho Register */
        __R  uint32_t DUMP;                    /* 0x2A8: DUMP Register */
        __RW uint32_t STS;                     /* 0x2AC: Status Register */
    } PCNT[1];
} PDGO_Type;


/* Bitfield definition for register: DGO_TURNOFF */
/*
 * COUNTER (WO)
 *
 * trunoff counter, counter stops when it counts down to 0, the trunoff occurs when the counter value is 1.
 */
#define PDGO_DGO_TURNOFF_COUNTER_MASK (0xFFFFFFFFUL)
#define PDGO_DGO_TURNOFF_COUNTER_SHIFT (0U)
#define PDGO_DGO_TURNOFF_COUNTER_SET(x) (((uint32_t)(x) << PDGO_DGO_TURNOFF_COUNTER_SHIFT) & PDGO_DGO_TURNOFF_COUNTER_MASK)
#define PDGO_DGO_TURNOFF_COUNTER_GET(x) (((uint32_t)(x) & PDGO_DGO_TURNOFF_COUNTER_MASK) >> PDGO_DGO_TURNOFF_COUNTER_SHIFT)

/* Bitfield definition for register: DGO_RC32K_CFG */
/*
 * COUNTER (RW)
 *
 * IRC32K trim happened, this bit set by hardware after trim value loaded, and stop load, write 0 will clear this bit and reload trim value
 * 0: irc is not trimmed
 * 1: irc is trimmed
 */
#define PDGO_DGO_RC32K_CFG_COUNTER_MASK (0x80000000UL)
#define PDGO_DGO_RC32K_CFG_COUNTER_SHIFT (31U)
#define PDGO_DGO_RC32K_CFG_COUNTER_SET(x) (((uint32_t)(x) << PDGO_DGO_RC32K_CFG_COUNTER_SHIFT) & PDGO_DGO_RC32K_CFG_COUNTER_MASK)
#define PDGO_DGO_RC32K_CFG_COUNTER_GET(x) (((uint32_t)(x) & PDGO_DGO_RC32K_CFG_COUNTER_MASK) >> PDGO_DGO_RC32K_CFG_COUNTER_SHIFT)

/*
 * CAPEX7_TRIM (RW)
 *
 * IRC32K bit 7
 */
#define PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_MASK (0x800000UL)
#define PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_SHIFT (23U)
#define PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_SET(x) (((uint32_t)(x) << PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_SHIFT) & PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_MASK)
#define PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_GET(x) (((uint32_t)(x) & PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_MASK) >> PDGO_DGO_RC32K_CFG_CAPEX7_TRIM_SHIFT)

/*
 * CAPEX6_TRIM (RW)
 *
 * IRC32K bit 6
 */
#define PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_MASK (0x400000UL)
#define PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_SHIFT (22U)
#define PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_SET(x) (((uint32_t)(x) << PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_SHIFT) & PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_MASK)
#define PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_GET(x) (((uint32_t)(x) & PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_MASK) >> PDGO_DGO_RC32K_CFG_CAPEX6_TRIM_SHIFT)

/*
 * CAP_TRIM (RW)
 *
 * capacitor trim bits
 */
#define PDGO_DGO_RC32K_CFG_CAP_TRIM_MASK (0x1FFU)
#define PDGO_DGO_RC32K_CFG_CAP_TRIM_SHIFT (0U)
#define PDGO_DGO_RC32K_CFG_CAP_TRIM_SET(x) (((uint32_t)(x) << PDGO_DGO_RC32K_CFG_CAP_TRIM_SHIFT) & PDGO_DGO_RC32K_CFG_CAP_TRIM_MASK)
#define PDGO_DGO_RC32K_CFG_CAP_TRIM_GET(x) (((uint32_t)(x) & PDGO_DGO_RC32K_CFG_CAP_TRIM_MASK) >> PDGO_DGO_RC32K_CFG_CAP_TRIM_SHIFT)

/* Bitfield definition for register: DGO_CTRL */
/*
 * RET (RW)
 *
 * Retention, retain contents in DGO.GPR[n] register after RSTN (When PMIC has power)
 * 0: Disable
 * 1: Enable
 */
#define PDGO_DGO_CTRL_RET_MASK (0x10000UL)
#define PDGO_DGO_CTRL_RET_SHIFT (16U)
#define PDGO_DGO_CTRL_RET_SET(x) (((uint32_t)(x) << PDGO_DGO_CTRL_RET_SHIFT) & PDGO_DGO_CTRL_RET_MASK)
#define PDGO_DGO_CTRL_RET_GET(x) (((uint32_t)(x) & PDGO_DGO_CTRL_RET_MASK) >> PDGO_DGO_CTRL_RET_SHIFT)

