hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * LESP (RW)
 *
 * Bandgap works in power save mode, bandgap function normally
 * 0: bandgap works in high performance mode
 * 1: bandgap works in power saving mode
 */
#define PDGO_DGO_CTRL_LESP_MASK (0x2U)
#define PDGO_DGO_CTRL_LESP_SHIFT (1U)
#define PDGO_DGO_CTRL_LESP_SET(x) (((uint32_t)(x) << PDGO_DGO_CTRL_LESP_SHIFT) & PDGO_DGO_CTRL_LESP_MASK)
#define PDGO_DGO_CTRL_LESP_GET(x) (((uint32_t)(x) & PDGO_DGO_CTRL_LESP_MASK) >> PDGO_DGO_CTRL_LESP_SHIFT)

/*
 * LOWP (RW)
 *
 * Bandgap works in low power mode, bandgap function limited
 * 0: bandgap works in normal mode
 * 1: bandgap works in low power mode
 */
#define PDGO_DGO_CTRL_LOWP_MASK (0x1U)
#define PDGO_DGO_CTRL_LOWP_SHIFT (0U)
#define PDGO_DGO_CTRL_LOWP_SET(x) (((uint32_t)(x) << PDGO_DGO_CTRL_LOWP_SHIFT) & PDGO_DGO_CTRL_LOWP_MASK)
#define PDGO_DGO_CTRL_LOWP_GET(x) (((uint32_t)(x) & PDGO_DGO_CTRL_LOWP_MASK) >> PDGO_DGO_CTRL_LOWP_SHIFT)

/* Bitfield definition for register: PIN_CTRL */
/*
 * RSTN (RW)
 *
 * resetn pin pull up disable
 * 0: Enable Pull Up
 * 1: Disable Pull Up
 */
#define PDGO_PIN_CTRL_RSTN_MASK (0x1000000UL)
#define PDGO_PIN_CTRL_RSTN_SHIFT (24U)
#define PDGO_PIN_CTRL_RSTN_SET(x) (((uint32_t)(x) << PDGO_PIN_CTRL_RSTN_SHIFT) & PDGO_PIN_CTRL_RSTN_MASK)
#define PDGO_PIN_CTRL_RSTN_GET(x) (((uint32_t)(x) & PDGO_PIN_CTRL_RSTN_MASK) >> PDGO_PIN_CTRL_RSTN_SHIFT)

/*
 * WKUP (RW)
 *
 * wakeup pin pull down disable
 * 0: Enable Pull Down
 * 1: Disable Pull Down
 */
#define PDGO_PIN_CTRL_WKUP_MASK (0x10000UL)
#define PDGO_PIN_CTRL_WKUP_SHIFT (16U)
#define PDGO_PIN_CTRL_WKUP_SET(x) (((uint32_t)(x) << PDGO_PIN_CTRL_WKUP_SHIFT) & PDGO_PIN_CTRL_WKUP_MASK)
#define PDGO_PIN_CTRL_WKUP_GET(x) (((uint32_t)(x) & PDGO_PIN_CTRL_WKUP_MASK) >> PDGO_PIN_CTRL_WKUP_SHIFT)

/*
 * WUIO3 (RW)
 *
 * WUIO pin pull down disable
 * 0: Enable Pull Down
 * 1: Disable Pull Down
 */
#define PDGO_PIN_CTRL_WUIO3_MASK (0x8U)
#define PDGO_PIN_CTRL_WUIO3_SHIFT (3U)
#define PDGO_PIN_CTRL_WUIO3_SET(x) (((uint32_t)(x) << PDGO_PIN_CTRL_WUIO3_SHIFT) & PDGO_PIN_CTRL_WUIO3_MASK)
#define PDGO_PIN_CTRL_WUIO3_GET(x) (((uint32_t)(x) & PDGO_PIN_CTRL_WUIO3_MASK) >> PDGO_PIN_CTRL_WUIO3_SHIFT)

/*
 * WUIO2 (RW)
 *
 * WUIO pin pull down disable
 * 0: Enable Pull Down
 * 1: Disable Pull Down
 */
#define PDGO_PIN_CTRL_WUIO2_MASK (0x4U)
#define PDGO_PIN_CTRL_WUIO2_SHIFT (2U)
#define PDGO_PIN_CTRL_WUIO2_SET(x) (((uint32_t)(x) << PDGO_PIN_CTRL_WUIO2_SHIFT) & PDGO_PIN_CTRL_WUIO2_MASK)
#define PDGO_PIN_CTRL_WUIO2_GET(x) (((uint32_t)(x) & PDGO_PIN_CTRL_WUIO2_MASK) >> PDGO_PIN_CTRL_WUIO2_SHIFT)

/*
 * WUIO1 (RW)
 *
 * WUIO pin pull down disable
 * 0: Enable Pull Down
 * 1: Disable Pull Down
 */
#define PDGO_PIN_CTRL_WUIO1_MASK (0x2U)
#define PDGO_PIN_CTRL_WUIO1_SHIFT (1U)
#define PDGO_PIN_CTRL_WUIO1_SET(x) (((uint32_t)(x) << PDGO_PIN_CTRL_WUIO1_SHIFT) & PDGO_PIN_CTRL_WUIO1_MASK)
#define PDGO_PIN_CTRL_WUIO1_GET(x) (((uint32_t)(x) & PDGO_PIN_CTRL_WUIO1_MASK) >> PDGO_PIN_CTRL_WUIO1_SHIFT)

/*
 * WUIO0 (RW)
 *
 * WUIO pin pull down disable
 * 0: Enable Pull Down
 * 1: Disable Pull Down
 */
#define PDGO_PIN_CTRL_WUIO0_MASK (0x1U)
#define PDGO_PIN_CTRL_WUIO0_SHIFT (0U)
#define PDGO_PIN_CTRL_WUIO0_SET(x) (((uint32_t)(x) << PDGO_PIN_CTRL_WUIO0_SHIFT) & PDGO_PIN_CTRL_WUIO0_MASK)
#define PDGO_PIN_CTRL_WUIO0_GET(x) (((uint32_t)(x) & PDGO_PIN_CTRL_WUIO0_MASK) >> PDGO_PIN_CTRL_WUIO0_SHIFT)

/* Bitfield definition for register: PIN_STS */
/*
 * TMOD (RO)
 *
 * TMOD Pin Status
 */
#define PDGO_PIN_STS_TMOD_MASK (0x80000000UL)
#define PDGO_PIN_STS_TMOD_SHIFT (31U)
#define PDGO_PIN_STS_TMOD_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_TMOD_MASK) >> PDGO_PIN_STS_TMOD_SHIFT)

/*
 * RSTN (RO)
 *
 * RSTN Pin Status
 */
#define PDGO_PIN_STS_RSTN_MASK (0x1000000UL)
#define PDGO_PIN_STS_RSTN_SHIFT (24U)
#define PDGO_PIN_STS_RSTN_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_RSTN_MASK) >> PDGO_PIN_STS_RSTN_SHIFT)

/*
 * WKUP (RO)
 *
 * WKUP pin status
 */
#define PDGO_PIN_STS_WKUP_MASK (0x10000UL)
#define PDGO_PIN_STS_WKUP_SHIFT (16U)
#define PDGO_PIN_STS_WKUP_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_WKUP_MASK) >> PDGO_PIN_STS_WKUP_SHIFT)

/*
 * WUIO3 (RO)
 *
 * WUIO3 pin status
 */
#define PDGO_PIN_STS_WUIO3_MASK (0x8U)
#define PDGO_PIN_STS_WUIO3_SHIFT (3U)
#define PDGO_PIN_STS_WUIO3_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_WUIO3_MASK) >> PDGO_PIN_STS_WUIO3_SHIFT)

/*
 * WUIO2 (RO)
 *
 * WUIO2 pin status
 */
#define PDGO_PIN_STS_WUIO2_MASK (0x4U)
#define PDGO_PIN_STS_WUIO2_SHIFT (2U)
#define PDGO_PIN_STS_WUIO2_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_WUIO2_MASK) >> PDGO_PIN_STS_WUIO2_SHIFT)

/*
 * WUIO1 (RO)
 *
 * WUIO1 pin status
 */
#define PDGO_PIN_STS_WUIO1_MASK (0x2U)
#define PDGO_PIN_STS_WUIO1_SHIFT (1U)
#define PDGO_PIN_STS_WUIO1_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_WUIO1_MASK) >> PDGO_PIN_STS_WUIO1_SHIFT)

/*
 * WUIO0 (RO)
 *
 * WUIO0 pin status
 */
#define PDGO_PIN_STS_WUIO0_MASK (0x1U)
#define PDGO_PIN_STS_WUIO0_SHIFT (0U)
#define PDGO_PIN_STS_WUIO0_GET(x) (((uint32_t)(x) & PDGO_PIN_STS_WUIO0_MASK) >> PDGO_PIN_STS_WUIO0_SHIFT)

/* Bitfield definition for register: WAKEUP */
/*
 * COUNTER (RW)
 *
 * software wake-up counter，counter stops when it counts down(base on 32KHz clock) to 0, the wakeup occurs when the counter value is 1.
 * wakeup once: write counter value here and set CYCLE register to be 0.
 * wakeup in cycle: write wakeup cycle in CYCLE register
 */
#define PDGO_WAKEUP_COUNTER_MASK (0xFFFFFFFFUL)
#define PDGO_WAKEUP_COUNTER_SHIFT (0U)
#define PDGO_WAKEUP_COUNTER_SET(x) (((uint32_t)(x) << PDGO_WAKEUP_COUNTER_SHIFT) & PDGO_WAKEUP_COUNTER_MASK)
#define PDGO_WAKEUP_COUNTER_GET(x) (((uint32_t)(x) & PDGO_WAKEUP_COUNTER_MASK) >> PDGO_WAKEUP_COUNTER_SHIFT)

/* Bitfield definition for register: WKUP_CYC */
/*
 * INTERVAL (RW)
 *
 * interval between wakeups, count by 32KHz clock cycles.
 */
#define PDGO_WKUP_CYC_INTERVAL_MASK (0xFFFFFFFFUL)
#define PDGO_WKUP_CYC_INTERVAL_SHIFT (0U)
#define PDGO_WKUP_CYC_INTERVAL_SET(x) (((uint32_t)(x) << PDGO_WKUP_CYC_INTERVAL_SHIFT) & PDGO_WKUP_CYC_INTERVAL_MASK)
#define PDGO_WKUP_CYC_INTERVAL_GET(x) (((uint32_t)(x) & PDGO_WKUP_CYC_INTERVAL_MASK) >> PDGO_WKUP_CYC_INTERVAL_SHIFT)

