hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/* Bitfield definition for register: WKUP_EN */
/*
 * PCNT0 (RW)
 *
 * Allow wake-up via Pulse PCNT0 events.
 * 0：Disable
 * 1：Enable
 * Note: wake-up interrupt request shloud be enable at the same time.
 */
#define PDGO_WKUP_EN_PCNT0_MASK (0x100U)
#define PDGO_WKUP_EN_PCNT0_SHIFT (8U)
#define PDGO_WKUP_EN_PCNT0_SET(x) (((uint32_t)(x) << PDGO_WKUP_EN_PCNT0_SHIFT) & PDGO_WKUP_EN_PCNT0_MASK)
#define PDGO_WKUP_EN_PCNT0_GET(x) (((uint32_t)(x) & PDGO_WKUP_EN_PCNT0_MASK) >> PDGO_WKUP_EN_PCNT0_SHIFT)

/*
 * PCAP0 (RW)
 *
 * Allow wake-up via PCAP0 events.
 * 0：Disable
 * 1：Enable
 * Note: wake-up interrupt request shloud be enable at the same time.
 */
#define PDGO_WKUP_EN_PCAP0_MASK (0x10U)
#define PDGO_WKUP_EN_PCAP0_SHIFT (4U)
#define PDGO_WKUP_EN_PCAP0_SET(x) (((uint32_t)(x) << PDGO_WKUP_EN_PCAP0_SHIFT) & PDGO_WKUP_EN_PCAP0_MASK)
#define PDGO_WKUP_EN_PCAP0_GET(x) (((uint32_t)(x) & PDGO_WKUP_EN_PCAP0_MASK) >> PDGO_WKUP_EN_PCAP0_SHIFT)

/*
 * WUIO (RW)
 *
 * Allow wake-up via WU00/WU01/WU02/WU03 pins.
 * 0：Disable
 * 1：Enable
 * Note: wake-up interrupt request shloud be enable at the same time.
 */
#define PDGO_WKUP_EN_WUIO_MASK (0x4U)
#define PDGO_WKUP_EN_WUIO_SHIFT (2U)
#define PDGO_WKUP_EN_WUIO_SET(x) (((uint32_t)(x) << PDGO_WKUP_EN_WUIO_SHIFT) & PDGO_WKUP_EN_WUIO_MASK)
#define PDGO_WKUP_EN_WUIO_GET(x) (((uint32_t)(x) & PDGO_WKUP_EN_WUIO_MASK) >> PDGO_WKUP_EN_WUIO_SHIFT)

/*
 * CYC (RW)
 *
 * Allow software wake-up via counter cycle.
 * 0：Disable
 * 1：Enable
 * Note: wake-up interrupt request shloud be enable at the same time.
 */
#define PDGO_WKUP_EN_CYC_MASK (0x2U)
#define PDGO_WKUP_EN_CYC_SHIFT (1U)
#define PDGO_WKUP_EN_CYC_SET(x) (((uint32_t)(x) << PDGO_WKUP_EN_CYC_SHIFT) & PDGO_WKUP_EN_CYC_MASK)
#define PDGO_WKUP_EN_CYC_GET(x) (((uint32_t)(x) & PDGO_WKUP_EN_CYC_MASK) >> PDGO_WKUP_EN_CYC_SHIFT)

/*
 * WKUP (RW)
 *
 * Allow wake-up via the WKUP pin.
 * 0：Disable
 * 1：Enable
 * Note: wake-up interrupt request shloud be enable at the same time.
 */
#define PDGO_WKUP_EN_WKUP_MASK (0x1U)
#define PDGO_WKUP_EN_WKUP_SHIFT (0U)
#define PDGO_WKUP_EN_WKUP_SET(x) (((uint32_t)(x) << PDGO_WKUP_EN_WKUP_SHIFT) & PDGO_WKUP_EN_WKUP_MASK)
#define PDGO_WKUP_EN_WKUP_GET(x) (((uint32_t)(x) & PDGO_WKUP_EN_WKUP_MASK) >> PDGO_WKUP_EN_WKUP_SHIFT)

/* Bitfield definition for register: WKUP_STS */
/*
 * PCNT0 (W1C)
 *
 * PCNT0 events wake-up status.
 * 0: wake-up is invalid
 * 1: wake-up is valid
 */
#define PDGO_WKUP_STS_PCNT0_MASK (0x100U)
#define PDGO_WKUP_STS_PCNT0_SHIFT (8U)
#define PDGO_WKUP_STS_PCNT0_SET(x) (((uint32_t)(x) << PDGO_WKUP_STS_PCNT0_SHIFT) & PDGO_WKUP_STS_PCNT0_MASK)
#define PDGO_WKUP_STS_PCNT0_GET(x) (((uint32_t)(x) & PDGO_WKUP_STS_PCNT0_MASK) >> PDGO_WKUP_STS_PCNT0_SHIFT)

/*
 * PCAP0 (W1C)
 *
 * PCAP0 events wake-up status.
 * 0: wake-up is invalid
 * 1: wake-up is valid
 */
#define PDGO_WKUP_STS_PCAP0_MASK (0x10U)
#define PDGO_WKUP_STS_PCAP0_SHIFT (4U)
#define PDGO_WKUP_STS_PCAP0_SET(x) (((uint32_t)(x) << PDGO_WKUP_STS_PCAP0_SHIFT) & PDGO_WKUP_STS_PCAP0_MASK)
#define PDGO_WKUP_STS_PCAP0_GET(x) (((uint32_t)(x) & PDGO_WKUP_STS_PCAP0_MASK) >> PDGO_WKUP_STS_PCAP0_SHIFT)

/*
 * WUIO (W1C)
 *
 * WUIO0/WUIO1/WUIO2/WUIO3 pins wake-up status.
 * 0: wake-up is invalid
 * 1: wake-up is valid
 */
#define PDGO_WKUP_STS_WUIO_MASK (0x4U)
#define PDGO_WKUP_STS_WUIO_SHIFT (2U)
#define PDGO_WKUP_STS_WUIO_SET(x) (((uint32_t)(x) << PDGO_WKUP_STS_WUIO_SHIFT) & PDGO_WKUP_STS_WUIO_MASK)
#define PDGO_WKUP_STS_WUIO_GET(x) (((uint32_t)(x) & PDGO_WKUP_STS_WUIO_MASK) >> PDGO_WKUP_STS_WUIO_SHIFT)

/*
 * CYC (W1C)
 *
 * counter cycle software wake-up status.
 * 0: wake-up is invalid
 * 1: wake-up is valid
 */
#define PDGO_WKUP_STS_CYC_MASK (0x2U)
#define PDGO_WKUP_STS_CYC_SHIFT (1U)
#define PDGO_WKUP_STS_CYC_SET(x) (((uint32_t)(x) << PDGO_WKUP_STS_CYC_SHIFT) & PDGO_WKUP_STS_CYC_MASK)
#define PDGO_WKUP_STS_CYC_GET(x) (((uint32_t)(x) & PDGO_WKUP_STS_CYC_MASK) >> PDGO_WKUP_STS_CYC_SHIFT)

/*
 * WKUP (W1C)
 *
 * WKUP pin wake-up status.
 * 0: wake-up is invalid
 * 1: wake-up is valid
 */
#define PDGO_WKUP_STS_WKUP_MASK (0x1U)
#define PDGO_WKUP_STS_WKUP_SHIFT (0U)
#define PDGO_WKUP_STS_WKUP_SET(x) (((uint32_t)(x) << PDGO_WKUP_STS_WKUP_SHIFT) & PDGO_WKUP_STS_WKUP_MASK)
#define PDGO_WKUP_STS_WKUP_GET(x) (((uint32_t)(x) & PDGO_WKUP_STS_WKUP_MASK) >> PDGO_WKUP_STS_WKUP_SHIFT)

/* Bitfield definition for register: IRQ0_EN */
/*
 * CYC (RW)
 *
 * Allow software counter cycle wake-up interrupt request.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ0_EN_CYC_MASK (0x20000UL)
#define PDGO_IRQ0_EN_CYC_SHIFT (17U)
#define PDGO_IRQ0_EN_CYC_SET(x) (((uint32_t)(x) << PDGO_IRQ0_EN_CYC_SHIFT) & PDGO_IRQ0_EN_CYC_MASK)
#define PDGO_IRQ0_EN_CYC_GET(x) (((uint32_t)(x) & PDGO_IRQ0_EN_CYC_MASK) >> PDGO_IRQ0_EN_CYC_SHIFT)

/*
 * WKUP (RW)
 *
 * Allow WKUP Pin wake-up interrupt request.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ0_EN_WKUP_MASK (0x10000UL)
#define PDGO_IRQ0_EN_WKUP_SHIFT (16U)
#define PDGO_IRQ0_EN_WKUP_SET(x) (((uint32_t)(x) << PDGO_IRQ0_EN_WKUP_SHIFT) & PDGO_IRQ0_EN_WKUP_MASK)
#define PDGO_IRQ0_EN_WKUP_GET(x) (((uint32_t)(x) & PDGO_IRQ0_EN_WKUP_MASK) >> PDGO_IRQ0_EN_WKUP_SHIFT)

/*
 * WUIO3 (RW)
 *
 * Allow WUIO3 Pin wake-up interrupt request.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ0_EN_WUIO3_MASK (0x8U)
#define PDGO_IRQ0_EN_WUIO3_SHIFT (3U)
#define PDGO_IRQ0_EN_WUIO3_SET(x) (((uint32_t)(x) << PDGO_IRQ0_EN_WUIO3_SHIFT) & PDGO_IRQ0_EN_WUIO3_MASK)
#define PDGO_IRQ0_EN_WUIO3_GET(x) (((uint32_t)(x) & PDGO_IRQ0_EN_WUIO3_MASK) >> PDGO_IRQ0_EN_WUIO3_SHIFT)

/*
 * WUIO2 (RW)
 *
 * Allow WUIO2 wake-up interrupt request.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ0_EN_WUIO2_MASK (0x4U)
#define PDGO_IRQ0_EN_WUIO2_SHIFT (2U)
#define PDGO_IRQ0_EN_WUIO2_SET(x) (((uint32_t)(x) << PDGO_IRQ0_EN_WUIO2_SHIFT) & PDGO_IRQ0_EN_WUIO2_MASK)
#define PDGO_IRQ0_EN_WUIO2_GET(x) (((uint32_t)(x) & PDGO_IRQ0_EN_WUIO2_MASK) >> PDGO_IRQ0_EN_WUIO2_SHIFT)

/*
 * WUIO1 (RW)
 *
 * Allow WUIO1 wake-up interrupt request.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ0_EN_WUIO1_MASK (0x2U)
#define PDGO_IRQ0_EN_WUIO1_SHIFT (1U)
#define PDGO_IRQ0_EN_WUIO1_SET(x) (((uint32_t)(x) << PDGO_IRQ0_EN_WUIO1_SHIFT) & PDGO_IRQ0_EN_WUIO1_MASK)
#define PDGO_IRQ0_EN_WUIO1_GET(x) (((uint32_t)(x) & PDGO_IRQ0_EN_WUIO1_MASK) >> PDGO_IRQ0_EN_WUIO1_SHIFT)

