hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * WUIO0 (RW)
 *
 * Allow WUIO0 wake-up interrupt request.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ0_EN_WUIO0_MASK (0x1U)
#define PDGO_IRQ0_EN_WUIO0_SHIFT (0U)
#define PDGO_IRQ0_EN_WUIO0_SET(x) (((uint32_t)(x) << PDGO_IRQ0_EN_WUIO0_SHIFT) & PDGO_IRQ0_EN_WUIO0_MASK)
#define PDGO_IRQ0_EN_WUIO0_GET(x) (((uint32_t)(x) & PDGO_IRQ0_EN_WUIO0_MASK) >> PDGO_IRQ0_EN_WUIO0_SHIFT)

/* Bitfield definition for register: IRQ0_STS */
/*
 * CYC (W1C)
 *
 * software counter cycle wake-up interrupt status.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ0_STS_CYC_MASK (0x20000UL)
#define PDGO_IRQ0_STS_CYC_SHIFT (17U)
#define PDGO_IRQ0_STS_CYC_SET(x) (((uint32_t)(x) << PDGO_IRQ0_STS_CYC_SHIFT) & PDGO_IRQ0_STS_CYC_MASK)
#define PDGO_IRQ0_STS_CYC_GET(x) (((uint32_t)(x) & PDGO_IRQ0_STS_CYC_MASK) >> PDGO_IRQ0_STS_CYC_SHIFT)

/*
 * WKUP (W1C)
 *
 * WKUP Pin wake-up interrupt status.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ0_STS_WKUP_MASK (0x10000UL)
#define PDGO_IRQ0_STS_WKUP_SHIFT (16U)
#define PDGO_IRQ0_STS_WKUP_SET(x) (((uint32_t)(x) << PDGO_IRQ0_STS_WKUP_SHIFT) & PDGO_IRQ0_STS_WKUP_MASK)
#define PDGO_IRQ0_STS_WKUP_GET(x) (((uint32_t)(x) & PDGO_IRQ0_STS_WKUP_MASK) >> PDGO_IRQ0_STS_WKUP_SHIFT)

/*
 * WUIO3 (W1C)
 *
 * WUIO3 Pin wake-up interrupt status.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ0_STS_WUIO3_MASK (0x8U)
#define PDGO_IRQ0_STS_WUIO3_SHIFT (3U)
#define PDGO_IRQ0_STS_WUIO3_SET(x) (((uint32_t)(x) << PDGO_IRQ0_STS_WUIO3_SHIFT) & PDGO_IRQ0_STS_WUIO3_MASK)
#define PDGO_IRQ0_STS_WUIO3_GET(x) (((uint32_t)(x) & PDGO_IRQ0_STS_WUIO3_MASK) >> PDGO_IRQ0_STS_WUIO3_SHIFT)

/*
 * WUIO2 (W1C)
 *
 * WUIO2 wake-up interrupt status.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ0_STS_WUIO2_MASK (0x4U)
#define PDGO_IRQ0_STS_WUIO2_SHIFT (2U)
#define PDGO_IRQ0_STS_WUIO2_SET(x) (((uint32_t)(x) << PDGO_IRQ0_STS_WUIO2_SHIFT) & PDGO_IRQ0_STS_WUIO2_MASK)
#define PDGO_IRQ0_STS_WUIO2_GET(x) (((uint32_t)(x) & PDGO_IRQ0_STS_WUIO2_MASK) >> PDGO_IRQ0_STS_WUIO2_SHIFT)

/*
 * WUIO1 (W1C)
 *
 * WUIO1 wake-up interrupt status.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ0_STS_WUIO1_MASK (0x2U)
#define PDGO_IRQ0_STS_WUIO1_SHIFT (1U)
#define PDGO_IRQ0_STS_WUIO1_SET(x) (((uint32_t)(x) << PDGO_IRQ0_STS_WUIO1_SHIFT) & PDGO_IRQ0_STS_WUIO1_MASK)
#define PDGO_IRQ0_STS_WUIO1_GET(x) (((uint32_t)(x) & PDGO_IRQ0_STS_WUIO1_MASK) >> PDGO_IRQ0_STS_WUIO1_SHIFT)

/*
 * WUIO0 (W1C)
 *
 * WUIO0 wake-up interrupt status.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ0_STS_WUIO0_MASK (0x1U)
#define PDGO_IRQ0_STS_WUIO0_SHIFT (0U)
#define PDGO_IRQ0_STS_WUIO0_SET(x) (((uint32_t)(x) << PDGO_IRQ0_STS_WUIO0_SHIFT) & PDGO_IRQ0_STS_WUIO0_MASK)
#define PDGO_IRQ0_STS_WUIO0_GET(x) (((uint32_t)(x) & PDGO_IRQ0_STS_WUIO0_MASK) >> PDGO_IRQ0_STS_WUIO0_SHIFT)

/* Bitfield definition for register: IRQ1_EN */
/*
 * PCNT0_SEQERR (RW)
 *
 * Allow pulse counter interrupt request when phase sequence error happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_SEQERR_MASK (0x800000UL)
#define PDGO_IRQ1_EN_PCNT0_SEQERR_SHIFT (23U)
#define PDGO_IRQ1_EN_PCNT0_SEQERR_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_SEQERR_SHIFT) & PDGO_IRQ1_EN_PCNT0_SEQERR_MASK)
#define PDGO_IRQ1_EN_PCNT0_SEQERR_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_SEQERR_MASK) >> PDGO_IRQ1_EN_PCNT0_SEQERR_SHIFT)

/*
 * PCNT0_DECERR (RW)
 *
 * Allow pulse counter interrupt request when decoder error happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_DECERR_MASK (0x400000UL)
#define PDGO_IRQ1_EN_PCNT0_DECERR_SHIFT (22U)
#define PDGO_IRQ1_EN_PCNT0_DECERR_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_DECERR_SHIFT) & PDGO_IRQ1_EN_PCNT0_DECERR_MASK)
#define PDGO_IRQ1_EN_PCNT0_DECERR_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_DECERR_MASK) >> PDGO_IRQ1_EN_PCNT0_DECERR_SHIFT)

/*
 * PCNT0_TACHO (RW)
 *
 * Allow pulse counter interrupt request when tacho done happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_TACHO_MASK (0x200000UL)
#define PDGO_IRQ1_EN_PCNT0_TACHO_SHIFT (21U)
#define PDGO_IRQ1_EN_PCNT0_TACHO_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_TACHO_SHIFT) & PDGO_IRQ1_EN_PCNT0_TACHO_MASK)
#define PDGO_IRQ1_EN_PCNT0_TACHO_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_TACHO_MASK) >> PDGO_IRQ1_EN_PCNT0_TACHO_SHIFT)

/*
 * PCNT0_MATCH0 (RW)
 *
 * Allow pulse counter interrupt request when match 0 events happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_MATCH0_MASK (0x80000UL)
#define PDGO_IRQ1_EN_PCNT0_MATCH0_SHIFT (19U)
#define PDGO_IRQ1_EN_PCNT0_MATCH0_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_MATCH0_SHIFT) & PDGO_IRQ1_EN_PCNT0_MATCH0_MASK)
#define PDGO_IRQ1_EN_PCNT0_MATCH0_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_MATCH0_MASK) >> PDGO_IRQ1_EN_PCNT0_MATCH0_SHIFT)

/*
 * PCNT0_HOME (RW)
 *
 * Allow pulse counter interrupt request when Phase h (HOME)  edges or level match events happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_HOME_MASK (0x40000UL)
#define PDGO_IRQ1_EN_PCNT0_HOME_SHIFT (18U)
#define PDGO_IRQ1_EN_PCNT0_HOME_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_HOME_SHIFT) & PDGO_IRQ1_EN_PCNT0_HOME_MASK)
#define PDGO_IRQ1_EN_PCNT0_HOME_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_HOME_MASK) >> PDGO_IRQ1_EN_PCNT0_HOME_SHIFT)

/*
 * PCNT0_Z (RW)
 *
 * Allow pulse counter interrupt request when Phase Z (INDEX)  edges or level match events happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_Z_MASK (0x20000UL)
#define PDGO_IRQ1_EN_PCNT0_Z_SHIFT (17U)
#define PDGO_IRQ1_EN_PCNT0_Z_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_Z_SHIFT) & PDGO_IRQ1_EN_PCNT0_Z_MASK)
#define PDGO_IRQ1_EN_PCNT0_Z_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_Z_MASK) >> PDGO_IRQ1_EN_PCNT0_Z_SHIFT)

/*
 * PCNT0_UPDATE (RW)
 *
 * Allow pulse counter interrupt request when counter updates.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCNT0_UPDATE_MASK (0x10000UL)
#define PDGO_IRQ1_EN_PCNT0_UPDATE_SHIFT (16U)
#define PDGO_IRQ1_EN_PCNT0_UPDATE_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCNT0_UPDATE_SHIFT) & PDGO_IRQ1_EN_PCNT0_UPDATE_MASK)
#define PDGO_IRQ1_EN_PCNT0_UPDATE_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCNT0_UPDATE_MASK) >> PDGO_IRQ1_EN_PCNT0_UPDATE_SHIFT)

