hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * PCAP0_MATCH (RW)
 *
 * Allow PCAP0 interrupt request when match events happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCAP0_MATCH_MASK (0x4U)
#define PDGO_IRQ1_EN_PCAP0_MATCH_SHIFT (2U)
#define PDGO_IRQ1_EN_PCAP0_MATCH_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCAP0_MATCH_SHIFT) & PDGO_IRQ1_EN_PCAP0_MATCH_MASK)
#define PDGO_IRQ1_EN_PCAP0_MATCH_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCAP0_MATCH_MASK) >> PDGO_IRQ1_EN_PCAP0_MATCH_SHIFT)

/*
 * PCAP0_DUMP (RW)
 *
 * Allow PCAP0 interrupt request when dump events happens.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCAP0_DUMP_MASK (0x2U)
#define PDGO_IRQ1_EN_PCAP0_DUMP_SHIFT (1U)
#define PDGO_IRQ1_EN_PCAP0_DUMP_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCAP0_DUMP_SHIFT) & PDGO_IRQ1_EN_PCAP0_DUMP_MASK)
#define PDGO_IRQ1_EN_PCAP0_DUMP_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCAP0_DUMP_MASK) >> PDGO_IRQ1_EN_PCAP0_DUMP_SHIFT)

/*
 * PCAP0_PERIOD (RW)
 *
 * Allow PCAP0 interrupt request when period done.
 * 0：Disable
 * 1：Enable
 */
#define PDGO_IRQ1_EN_PCAP0_PERIOD_MASK (0x1U)
#define PDGO_IRQ1_EN_PCAP0_PERIOD_SHIFT (0U)
#define PDGO_IRQ1_EN_PCAP0_PERIOD_SET(x) (((uint32_t)(x) << PDGO_IRQ1_EN_PCAP0_PERIOD_SHIFT) & PDGO_IRQ1_EN_PCAP0_PERIOD_MASK)
#define PDGO_IRQ1_EN_PCAP0_PERIOD_GET(x) (((uint32_t)(x) & PDGO_IRQ1_EN_PCAP0_PERIOD_MASK) >> PDGO_IRQ1_EN_PCAP0_PERIOD_SHIFT)

/* Bitfield definition for register: IRQ1_STS */
/*
 * PCNT0_SEQERR (W1C)
 *
 * pulse counter interrupt status when phase sequence error happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_SEQERR_MASK (0x800000UL)
#define PDGO_IRQ1_STS_PCNT0_SEQERR_SHIFT (23U)
#define PDGO_IRQ1_STS_PCNT0_SEQERR_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_SEQERR_SHIFT) & PDGO_IRQ1_STS_PCNT0_SEQERR_MASK)
#define PDGO_IRQ1_STS_PCNT0_SEQERR_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_SEQERR_MASK) >> PDGO_IRQ1_STS_PCNT0_SEQERR_SHIFT)

/*
 * PCNT0_DECERR (W1C)
 *
 * pulse counter interrupt status when decoder error happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_DECERR_MASK (0x400000UL)
#define PDGO_IRQ1_STS_PCNT0_DECERR_SHIFT (22U)
#define PDGO_IRQ1_STS_PCNT0_DECERR_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_DECERR_SHIFT) & PDGO_IRQ1_STS_PCNT0_DECERR_MASK)
#define PDGO_IRQ1_STS_PCNT0_DECERR_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_DECERR_MASK) >> PDGO_IRQ1_STS_PCNT0_DECERR_SHIFT)

/*
 * PCNT0_TACHO (W1C)
 *
 * pulse counter interrupt status when tacho done happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_TACHO_MASK (0x200000UL)
#define PDGO_IRQ1_STS_PCNT0_TACHO_SHIFT (21U)
#define PDGO_IRQ1_STS_PCNT0_TACHO_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_TACHO_SHIFT) & PDGO_IRQ1_STS_PCNT0_TACHO_MASK)
#define PDGO_IRQ1_STS_PCNT0_TACHO_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_TACHO_MASK) >> PDGO_IRQ1_STS_PCNT0_TACHO_SHIFT)

/*
 * PCNT0_MATCH0 (W1C)
 *
 * pulse counter interrupt status when match 0 events happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_MATCH0_MASK (0x80000UL)
#define PDGO_IRQ1_STS_PCNT0_MATCH0_SHIFT (19U)
#define PDGO_IRQ1_STS_PCNT0_MATCH0_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_MATCH0_SHIFT) & PDGO_IRQ1_STS_PCNT0_MATCH0_MASK)
#define PDGO_IRQ1_STS_PCNT0_MATCH0_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_MATCH0_MASK) >> PDGO_IRQ1_STS_PCNT0_MATCH0_SHIFT)

/*
 * PCNT0_HOME (W1C)
 *
 * pulse counter interrupt status when Phase H (HOME) edges or level match events happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_HOME_MASK (0x40000UL)
#define PDGO_IRQ1_STS_PCNT0_HOME_SHIFT (18U)
#define PDGO_IRQ1_STS_PCNT0_HOME_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_HOME_SHIFT) & PDGO_IRQ1_STS_PCNT0_HOME_MASK)
#define PDGO_IRQ1_STS_PCNT0_HOME_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_HOME_MASK) >> PDGO_IRQ1_STS_PCNT0_HOME_SHIFT)

/*
 * PCNT0_Z (W1C)
 *
 * pulse counter interrupt status when Phase Z (INDEX) edges or level match events happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_Z_MASK (0x20000UL)
#define PDGO_IRQ1_STS_PCNT0_Z_SHIFT (17U)
#define PDGO_IRQ1_STS_PCNT0_Z_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_Z_SHIFT) & PDGO_IRQ1_STS_PCNT0_Z_MASK)
#define PDGO_IRQ1_STS_PCNT0_Z_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_Z_MASK) >> PDGO_IRQ1_STS_PCNT0_Z_SHIFT)

/*
 * PCNT0_UPDATE (W1C)
 *
 * pulse counter interrupt status when counter updates.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCNT0_UPDATE_MASK (0x10000UL)
#define PDGO_IRQ1_STS_PCNT0_UPDATE_SHIFT (16U)
#define PDGO_IRQ1_STS_PCNT0_UPDATE_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCNT0_UPDATE_SHIFT) & PDGO_IRQ1_STS_PCNT0_UPDATE_MASK)
#define PDGO_IRQ1_STS_PCNT0_UPDATE_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCNT0_UPDATE_MASK) >> PDGO_IRQ1_STS_PCNT0_UPDATE_SHIFT)

/*
 * PCAP0_MATCH (W1C)
 *
 * PCAP0 interrupt status when match events happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCAP0_MATCH_MASK (0x4U)
#define PDGO_IRQ1_STS_PCAP0_MATCH_SHIFT (2U)
#define PDGO_IRQ1_STS_PCAP0_MATCH_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCAP0_MATCH_SHIFT) & PDGO_IRQ1_STS_PCAP0_MATCH_MASK)
#define PDGO_IRQ1_STS_PCAP0_MATCH_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCAP0_MATCH_MASK) >> PDGO_IRQ1_STS_PCAP0_MATCH_SHIFT)

/*
 * PCAP0_DUMP (W1C)
 *
 * PCAP0 interrupt status when dump events happens.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCAP0_DUMP_MASK (0x2U)
#define PDGO_IRQ1_STS_PCAP0_DUMP_SHIFT (1U)
#define PDGO_IRQ1_STS_PCAP0_DUMP_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCAP0_DUMP_SHIFT) & PDGO_IRQ1_STS_PCAP0_DUMP_MASK)
#define PDGO_IRQ1_STS_PCAP0_DUMP_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCAP0_DUMP_MASK) >> PDGO_IRQ1_STS_PCAP0_DUMP_SHIFT)

/*
 * PCAP0_PERIOD (W1C)
 *
 * PCAP0 interrupt status when period done.
 * 0： is invalid
 * 1： is valid
 */
#define PDGO_IRQ1_STS_PCAP0_PERIOD_MASK (0x1U)
#define PDGO_IRQ1_STS_PCAP0_PERIOD_SHIFT (0U)
#define PDGO_IRQ1_STS_PCAP0_PERIOD_SET(x) (((uint32_t)(x) << PDGO_IRQ1_STS_PCAP0_PERIOD_SHIFT) & PDGO_IRQ1_STS_PCAP0_PERIOD_MASK)
#define PDGO_IRQ1_STS_PCAP0_PERIOD_GET(x) (((uint32_t)(x) & PDGO_IRQ1_STS_PCAP0_PERIOD_MASK) >> PDGO_IRQ1_STS_PCAP0_PERIOD_SHIFT)

/* Bitfield definition for register array: GPR */
/*
 * VALUE (RW)
 *
 * Value
 */
#define PDGO_GPR_VALUE_MASK (0xFFFFFFFFUL)
#define PDGO_GPR_VALUE_SHIFT (0U)
#define PDGO_GPR_VALUE_SET(x) (((uint32_t)(x) << PDGO_GPR_VALUE_SHIFT) & PDGO_GPR_VALUE_MASK)
#define PDGO_GPR_VALUE_GET(x) (((uint32_t)(x) & PDGO_GPR_VALUE_MASK) >> PDGO_GPR_VALUE_SHIFT)

/* Bitfield definition for register array: IOFILTER */
/*
 * EN (RW)
 *
 * Allow this IO filter channel output
 * 0： Disable
 * 1： Enable
 */
#define PDGO_IOFILTER_EN_MASK (0x80000000UL)
#define PDGO_IOFILTER_EN_SHIFT (31U)
#define PDGO_IOFILTER_EN_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_EN_SHIFT) & PDGO_IOFILTER_EN_MASK)
#define PDGO_IOFILTER_EN_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_EN_MASK) >> PDGO_IOFILTER_EN_SHIFT)

