hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * IRQMODE (RW)
 *
 * Filter IRQ Mode:
 * 0： Disable
 * 1： Level Mode
 * 2： Rising Edge
 * 3： Rising Edge or Falling Edge
 */
#define PDGO_IOFILTER_IRQMODE_MASK (0x3000000UL)
#define PDGO_IOFILTER_IRQMODE_SHIFT (24U)
#define PDGO_IOFILTER_IRQMODE_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_IRQMODE_SHIFT) & PDGO_IOFILTER_IRQMODE_MASK)
#define PDGO_IOFILTER_IRQMODE_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_IRQMODE_MASK) >> PDGO_IOFILTER_IRQMODE_SHIFT)

/*
 * NORM (RW)
 *
 * Initial output value
 */
#define PDGO_IOFILTER_NORM_MASK (0x200000UL)
#define PDGO_IOFILTER_NORM_SHIFT (21U)
#define PDGO_IOFILTER_NORM_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_NORM_SHIFT) & PDGO_IOFILTER_NORM_MASK)
#define PDGO_IOFILTER_NORM_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_NORM_MASK) >> PDGO_IOFILTER_NORM_SHIFT)

/*
 * INV (RW)
 *
 * Invert Filter output result.
 */
#define PDGO_IOFILTER_INV_MASK (0x100000UL)
#define PDGO_IOFILTER_INV_SHIFT (20U)
#define PDGO_IOFILTER_INV_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_INV_SHIFT) & PDGO_IOFILTER_INV_MASK)
#define PDGO_IOFILTER_INV_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_INV_MASK) >> PDGO_IOFILTER_INV_SHIFT)

/*
 * BYPASS (RW)
 *
 * Bypass Mode
 * 0： Disable Bypass Mode
 * 1： Enable Bypass Mode, use filter input as result output
 */
#define PDGO_IOFILTER_BYPASS_MASK (0x40000UL)
#define PDGO_IOFILTER_BYPASS_SHIFT (18U)
#define PDGO_IOFILTER_BYPASS_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_BYPASS_SHIFT) & PDGO_IOFILTER_BYPASS_MASK)
#define PDGO_IOFILTER_BYPASS_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_BYPASS_MASK) >> PDGO_IOFILTER_BYPASS_SHIFT)

/*
 * MODE (RW)
 *
 * Filter Mode:
 * 0： Rapid change mode
 * 1： Delay filter mode
 * 2： Stalbe low mode
 * 3： Stable high mode
 */
#define PDGO_IOFILTER_MODE_MASK (0x30000UL)
#define PDGO_IOFILTER_MODE_SHIFT (16U)
#define PDGO_IOFILTER_MODE_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_MODE_SHIFT) & PDGO_IOFILTER_MODE_MASK)
#define PDGO_IOFILTER_MODE_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_MODE_MASK) >> PDGO_IOFILTER_MODE_SHIFT)

/*
 * FILTER_LEN (RW)
 *
 * Filter Length(Base on 32K clock)
 */
#define PDGO_IOFILTER_FILTER_LEN_MASK (0x3FFU)
#define PDGO_IOFILTER_FILTER_LEN_SHIFT (0U)
#define PDGO_IOFILTER_FILTER_LEN_SET(x) (((uint32_t)(x) << PDGO_IOFILTER_FILTER_LEN_SHIFT) & PDGO_IOFILTER_FILTER_LEN_MASK)
#define PDGO_IOFILTER_FILTER_LEN_GET(x) (((uint32_t)(x) & PDGO_IOFILTER_FILTER_LEN_MASK) >> PDGO_IOFILTER_FILTER_LEN_SHIFT)

/* Bitfield definition for register of struct array PCAP: CTRL */
/*
 * EN (RW)
 *
 * Enable PCAP counter
 * 0： Disable
 * 1： Enable
 * Note:  Other registers should be configured before enable this bit.
 */
#define PDGO_PCAP_CTRL_EN_MASK (0x80000000UL)
#define PDGO_PCAP_CTRL_EN_SHIFT (31U)
#define PDGO_PCAP_CTRL_EN_SET(x) (((uint32_t)(x) << PDGO_PCAP_CTRL_EN_SHIFT) & PDGO_PCAP_CTRL_EN_MASK)
#define PDGO_PCAP_CTRL_EN_GET(x) (((uint32_t)(x) & PDGO_PCAP_CTRL_EN_MASK) >> PDGO_PCAP_CTRL_EN_SHIFT)

/*
 * SELECT (RW)
 *
 * Select Input for counter:
 * 0:  Use WUIO0 as input
 * 1:  Use WUIO1 as input
 * 2:  Use WUIO2 as input
 * 3:  Use WUIO3 as input
 */
#define PDGO_PCAP_CTRL_SELECT_MASK (0x3000000UL)
#define PDGO_PCAP_CTRL_SELECT_SHIFT (24U)
#define PDGO_PCAP_CTRL_SELECT_SET(x) (((uint32_t)(x) << PDGO_PCAP_CTRL_SELECT_SHIFT) & PDGO_PCAP_CTRL_SELECT_MASK)
#define PDGO_PCAP_CTRL_SELECT_GET(x) (((uint32_t)(x) & PDGO_PCAP_CTRL_SELECT_MASK) >> PDGO_PCAP_CTRL_SELECT_SHIFT)

/*
 * MATCH_MODE (RW)
 *
 * Match Mode Selection. Generate Match Pulse when :
 * 0   : Disable Match Mode;
 * 1   : Reserved;
 * 2   : COUNTER >= COMPARE;
 * 3   : COUNTER <= COMPARE;
 * 4   : HIGH_DUMP >= COMPARE;
 * 5   : HIGH_DUMP <= COMPARE;
 * 6   : LOW_DUMP >= COMPARE;
 * 7   : LOW_DUMP <= COMPARE;
 * 8   : (HIGH_DUMP  + LOW_DUMP) >= COMPARE;
 * 9   : (HIGH_DUMP  + LOW_DUMP) <= COMPARE;
 * 10 :  | HIGH_DUMP  - LOW_DUMP | >= COMPARE;
 * 11 :  | HIGH_DUMP  - LOW_DUMP | <= COMPARE;
 * 12 :  | HIGH_DUMP  - LOW_DUMP | >= COMPARE and HIGH_DUMP >= LOW_DUMP;
 * 13 :  | HIGH_DUMP  - LOW_DUMP | <= COMPARE and LOW_DUMP >= HIGH_DUMP;
 * 14 :  | HIGH_DUMP  - LOW_DUMP | >= COMPARE and HIGH_DUMP <= LOW_DUMP;
 * 15 :  | HIGH_DUMP  - LOW_DUMP | <= COMPARE and LOW_DUMP <= HIGH_DUMP;
 */
#define PDGO_PCAP_CTRL_MATCH_MODE_MASK (0xF0000UL)
#define PDGO_PCAP_CTRL_MATCH_MODE_SHIFT (16U)
#define PDGO_PCAP_CTRL_MATCH_MODE_SET(x) (((uint32_t)(x) << PDGO_PCAP_CTRL_MATCH_MODE_SHIFT) & PDGO_PCAP_CTRL_MATCH_MODE_MASK)
#define PDGO_PCAP_CTRL_MATCH_MODE_GET(x) (((uint32_t)(x) & PDGO_PCAP_CTRL_MATCH_MODE_MASK) >> PDGO_PCAP_CTRL_MATCH_MODE_SHIFT)

/*
 * DUMP_MODE (RW)
 *
 * Dump Mode, select the time using to update LOW_DUMP(input signal's low level time) and HIGH_DUMP(input signal's high level time):
 * 00: Disable Dump
 * 01: Update at rising edge. (input selection via SELECT bit field)
 * 10: Update at falling edge.  (input selected via SELECT bit field)
 * 11: Update when COUNTER counts period done.
 */
#define PDGO_PCAP_CTRL_DUMP_MODE_MASK (0x300U)
#define PDGO_PCAP_CTRL_DUMP_MODE_SHIFT (8U)
#define PDGO_PCAP_CTRL_DUMP_MODE_SET(x) (((uint32_t)(x) << PDGO_PCAP_CTRL_DUMP_MODE_SHIFT) & PDGO_PCAP_CTRL_DUMP_MODE_MASK)
#define PDGO_PCAP_CTRL_DUMP_MODE_GET(x) (((uint32_t)(x) & PDGO_PCAP_CTRL_DUMP_MODE_MASK) >> PDGO_PCAP_CTRL_DUMP_MODE_SHIFT)

/*
 * COUNT_MODE (RW)
 *
 * Count Mode
 * - when Bit[0]:
 * 0: Count up
 * 1: Count down
 * - when Bit[1]:
 * 0: Oneshot mode
 * 1: Period Mode
 * - when Bit[3:2]:
 * 00: Count by internal 32KHz clock
 * 01: Count updates when rising edge
 * 10: Count updates when falling edge
 */
#define PDGO_PCAP_CTRL_COUNT_MODE_MASK (0xFU)
#define PDGO_PCAP_CTRL_COUNT_MODE_SHIFT (0U)
#define PDGO_PCAP_CTRL_COUNT_MODE_SET(x) (((uint32_t)(x) << PDGO_PCAP_CTRL_COUNT_MODE_SHIFT) & PDGO_PCAP_CTRL_COUNT_MODE_MASK)
#define PDGO_PCAP_CTRL_COUNT_MODE_GET(x) (((uint32_t)(x) & PDGO_PCAP_CTRL_COUNT_MODE_MASK) >> PDGO_PCAP_CTRL_COUNT_MODE_SHIFT)

/* Bitfield definition for register of struct array PCAP: CP_CFG */
/*
 * COMPARE (RW)
 *
 * Compare Value
 * Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.
 */
#define PDGO_PCAP_CP_CFG_COMPARE_MASK (0xFFFF0000UL)
#define PDGO_PCAP_CP_CFG_COMPARE_SHIFT (16U)
#define PDGO_PCAP_CP_CFG_COMPARE_SET(x) (((uint32_t)(x) << PDGO_PCAP_CP_CFG_COMPARE_SHIFT) & PDGO_PCAP_CP_CFG_COMPARE_MASK)
#define PDGO_PCAP_CP_CFG_COMPARE_GET(x) (((uint32_t)(x) & PDGO_PCAP_CP_CFG_COMPARE_MASK) >> PDGO_PCAP_CP_CFG_COMPARE_SHIFT)

