hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * PERIOD (RW)
 *
 * Period Value
 * Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.
 */
#define PDGO_PCAP_CP_CFG_PERIOD_MASK (0xFFFFU)
#define PDGO_PCAP_CP_CFG_PERIOD_SHIFT (0U)
#define PDGO_PCAP_CP_CFG_PERIOD_SET(x) (((uint32_t)(x) << PDGO_PCAP_CP_CFG_PERIOD_SHIFT) & PDGO_PCAP_CP_CFG_PERIOD_MASK)
#define PDGO_PCAP_CP_CFG_PERIOD_GET(x) (((uint32_t)(x) & PDGO_PCAP_CP_CFG_PERIOD_MASK) >> PDGO_PCAP_CP_CFG_PERIOD_SHIFT)

/* Bitfield definition for register of struct array PCAP: COUNTER */
/*
 * COUNTER (RW)
 *
 * Counter Value
 */
#define PDGO_PCAP_COUNTER_COUNTER_MASK (0xFFFFU)
#define PDGO_PCAP_COUNTER_COUNTER_SHIFT (0U)
#define PDGO_PCAP_COUNTER_COUNTER_SET(x) (((uint32_t)(x) << PDGO_PCAP_COUNTER_COUNTER_SHIFT) & PDGO_PCAP_COUNTER_COUNTER_MASK)
#define PDGO_PCAP_COUNTER_COUNTER_GET(x) (((uint32_t)(x) & PDGO_PCAP_COUNTER_COUNTER_MASK) >> PDGO_PCAP_COUNTER_COUNTER_SHIFT)

/* Bitfield definition for register of struct array PCAP: DUMP */
/*
 * LOW_DUMP (RW)
 *
 * Dump Value: Low Level Time(Base on 32K Clock)
 */
#define PDGO_PCAP_DUMP_LOW_DUMP_MASK (0xFFFF0000UL)
#define PDGO_PCAP_DUMP_LOW_DUMP_SHIFT (16U)
#define PDGO_PCAP_DUMP_LOW_DUMP_SET(x) (((uint32_t)(x) << PDGO_PCAP_DUMP_LOW_DUMP_SHIFT) & PDGO_PCAP_DUMP_LOW_DUMP_MASK)
#define PDGO_PCAP_DUMP_LOW_DUMP_GET(x) (((uint32_t)(x) & PDGO_PCAP_DUMP_LOW_DUMP_MASK) >> PDGO_PCAP_DUMP_LOW_DUMP_SHIFT)

/*
 * HIGH_DUMP (RW)
 *
 * Dump Value: High Level Time(Base on 32K Clock)
 */
#define PDGO_PCAP_DUMP_HIGH_DUMP_MASK (0xFFFFU)
#define PDGO_PCAP_DUMP_HIGH_DUMP_SHIFT (0U)
#define PDGO_PCAP_DUMP_HIGH_DUMP_SET(x) (((uint32_t)(x) << PDGO_PCAP_DUMP_HIGH_DUMP_SHIFT) & PDGO_PCAP_DUMP_HIGH_DUMP_MASK)
#define PDGO_PCAP_DUMP_HIGH_DUMP_GET(x) (((uint32_t)(x) & PDGO_PCAP_DUMP_HIGH_DUMP_MASK) >> PDGO_PCAP_DUMP_HIGH_DUMP_SHIFT)

/* Bitfield definition for register of struct array PCNT: CNT_CFG */
/*
 * EN (RW)
 *
 * Enable Pulse Counter
 * 0： Disable
 * 1： Enable
 * Note:  Other registers should be configured before enable this bit.
 */
#define PDGO_PCNT_CNT_CFG_EN_MASK (0x80000000UL)
#define PDGO_PCNT_CNT_CFG_EN_SHIFT (31U)
#define PDGO_PCNT_CNT_CFG_EN_SET(x) (((uint32_t)(x) << PDGO_PCNT_CNT_CFG_EN_SHIFT) & PDGO_PCNT_CNT_CFG_EN_MASK)
#define PDGO_PCNT_CNT_CFG_EN_GET(x) (((uint32_t)(x) & PDGO_PCNT_CNT_CFG_EN_MASK) >> PDGO_PCNT_CNT_CFG_EN_SHIFT)

/*
 * OVRD (RW)
 *
 * Software Override Direction
 * 0： Disable
 * 1： Enable
 */
#define PDGO_PCNT_CNT_CFG_OVRD_MASK (0x1000U)
#define PDGO_PCNT_CNT_CFG_OVRD_SHIFT (12U)
#define PDGO_PCNT_CNT_CFG_OVRD_SET(x) (((uint32_t)(x) << PDGO_PCNT_CNT_CFG_OVRD_SHIFT) & PDGO_PCNT_CNT_CFG_OVRD_MASK)
#define PDGO_PCNT_CNT_CFG_OVRD_GET(x) (((uint32_t)(x) & PDGO_PCNT_CNT_CFG_OVRD_MASK) >> PDGO_PCNT_CNT_CFG_OVRD_SHIFT)

/*
 * SEQ (RW)
 *
 * Change the direction of decoder
 * 0： Disable
 * 1： Enable
 * If enable：
 * In PD Mode：modify the positive direction by using high level in D channel as forward .
 * In UD Mode：modify the positive direction by using pulse in U channel as forward, pulse in D channel as reverse.
 * In ABZ Mode：modify the positive direction by using B channel's phase lead over A channel as forward.
 * In UVW Mode：modify the positive direction by using W channel lead as forward.
 */
#define PDGO_PCNT_CNT_CFG_SEQ_MASK (0x100U)
#define PDGO_PCNT_CNT_CFG_SEQ_SHIFT (8U)
#define PDGO_PCNT_CNT_CFG_SEQ_SET(x) (((uint32_t)(x) << PDGO_PCNT_CNT_CFG_SEQ_SHIFT) & PDGO_PCNT_CNT_CFG_SEQ_MASK)
#define PDGO_PCNT_CNT_CFG_SEQ_GET(x) (((uint32_t)(x) & PDGO_PCNT_CNT_CFG_SEQ_MASK) >> PDGO_PCNT_CNT_CFG_SEQ_SHIFT)

/*
 * BIAS (RW)
 *
 * Bias compensation, compensation for decoded phase
 */
#define PDGO_PCNT_CNT_CFG_BIAS_MASK (0x70U)
#define PDGO_PCNT_CNT_CFG_BIAS_SHIFT (4U)
#define PDGO_PCNT_CNT_CFG_BIAS_SET(x) (((uint32_t)(x) << PDGO_PCNT_CNT_CFG_BIAS_SHIFT) & PDGO_PCNT_CNT_CFG_BIAS_MASK)
#define PDGO_PCNT_CNT_CFG_BIAS_GET(x) (((uint32_t)(x) & PDGO_PCNT_CNT_CFG_BIAS_MASK) >> PDGO_PCNT_CNT_CFG_BIAS_SHIFT)

/*
 * DECODE_MODE (RW)
 *
 * Decode Mode:
 * 0: MODE_AB_4X
 * 1: MODE_AB_2X
 * 2: MODE_AB_1X
 * 3: Reserved
 * 4: MODE_PD_1X
 * 5: MODE_PDF1X（Disable checking of direction change when input pulse is valid）
 * 6: MODE_PD_2X
 * 7: MODE_PDF2X（Disable checking of direction change when input pulse is valid）
 * 8: MODE_UD_1X
 * 9: MODE_UDF1X（Disable checking if both channel U and D are valid at the same time）
 * 10: MODE_UD_2X
 * 11: MODE_UDF2X（Disable checking if both channel U and D are valid at the same time）
 * 12: MODE_UVW6X (120°)
 * 13: MODE_UVW6Y (  60°)
 * 14: Reserved
 * 15: Reserved
 */
#define PDGO_PCNT_CNT_CFG_DECODE_MODE_MASK (0xFU)
#define PDGO_PCNT_CNT_CFG_DECODE_MODE_SHIFT (0U)
#define PDGO_PCNT_CNT_CFG_DECODE_MODE_SET(x) (((uint32_t)(x) << PDGO_PCNT_CNT_CFG_DECODE_MODE_SHIFT) & PDGO_PCNT_CNT_CFG_DECODE_MODE_MASK)
#define PDGO_PCNT_CNT_CFG_DECODE_MODE_GET(x) (((uint32_t)(x) & PDGO_PCNT_CNT_CFG_DECODE_MODE_MASK) >> PDGO_PCNT_CNT_CFG_DECODE_MODE_SHIFT)

/* Bitfield definition for register of struct array PCNT: CALIB_CFG */
/*
 * ZMODE (RW)
 *
 * Phase Z Mode Select
 * 0：Disable
 * 1：Edge Mode(Use Edge in ZSTATE Register)
 * 2：Level Mode(Match Phase A,B and Z)
 * 3：Level Mode(Only Match Phase Z)
 */
#define PDGO_PCNT_CALIB_CFG_ZMODE_MASK (0x300000UL)
#define PDGO_PCNT_CALIB_CFG_ZMODE_SHIFT (20U)
#define PDGO_PCNT_CALIB_CFG_ZMODE_SET(x) (((uint32_t)(x) << PDGO_PCNT_CALIB_CFG_ZMODE_SHIFT) & PDGO_PCNT_CALIB_CFG_ZMODE_MASK)
#define PDGO_PCNT_CALIB_CFG_ZMODE_GET(x) (((uint32_t)(x) & PDGO_PCNT_CALIB_CFG_ZMODE_MASK) >> PDGO_PCNT_CALIB_CFG_ZMODE_SHIFT)

/*
 * ZSTATE (RW)
 *
 * Phase Z Matching Status
 * -When in level mode:
 * A bit2 of 1 indicates at the rising edge of the Z phase, and 0 at the falling edge.
 * The remaining bits correspond to the level state of the HZBA phase.
 * -When edge mode:
 * If bit3 is 1: Match Z-phase rising edge, reverse
 * If bit2 is 1: Match Z-phase falling edge, forward
 * If bit1 is 1: Match Z-phase falling edge, reverse
 * If bit0 is 1: Match Z-phase rising edge, forward.
 */
#define PDGO_PCNT_CALIB_CFG_ZSTATE_MASK (0xF0000UL)
#define PDGO_PCNT_CALIB_CFG_ZSTATE_SHIFT (16U)
#define PDGO_PCNT_CALIB_CFG_ZSTATE_SET(x) (((uint32_t)(x) << PDGO_PCNT_CALIB_CFG_ZSTATE_SHIFT) & PDGO_PCNT_CALIB_CFG_ZSTATE_MASK)
#define PDGO_PCNT_CALIB_CFG_ZSTATE_GET(x) (((uint32_t)(x) & PDGO_PCNT_CALIB_CFG_ZSTATE_MASK) >> PDGO_PCNT_CALIB_CFG_ZSTATE_SHIFT)

