hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * H_SEL (RW)
 *
 * Select Input for Phase H：
 * 0：WUIO0
 * 1：WUIO1
 * 2：WUIO2
 * 3：WUIO3
 */
#define PDGO_PCNT_CALIB_CFG_H_SEL_MASK (0x3000U)
#define PDGO_PCNT_CALIB_CFG_H_SEL_SHIFT (12U)
#define PDGO_PCNT_CALIB_CFG_H_SEL_SET(x) (((uint32_t)(x) << PDGO_PCNT_CALIB_CFG_H_SEL_SHIFT) & PDGO_PCNT_CALIB_CFG_H_SEL_MASK)
#define PDGO_PCNT_CALIB_CFG_H_SEL_GET(x) (((uint32_t)(x) & PDGO_PCNT_CALIB_CFG_H_SEL_MASK) >> PDGO_PCNT_CALIB_CFG_H_SEL_SHIFT)

/*
 * Z_SEL (RW)
 *
 * Select Input for Phase Z：
 * 0：WUIO0
 * 1：WUIO1
 * 2：WUIO2
 * 3：WUIO3
 */
#define PDGO_PCNT_CALIB_CFG_Z_SEL_MASK (0x300U)
#define PDGO_PCNT_CALIB_CFG_Z_SEL_SHIFT (8U)
#define PDGO_PCNT_CALIB_CFG_Z_SEL_SET(x) (((uint32_t)(x) << PDGO_PCNT_CALIB_CFG_Z_SEL_SHIFT) & PDGO_PCNT_CALIB_CFG_Z_SEL_MASK)
#define PDGO_PCNT_CALIB_CFG_Z_SEL_GET(x) (((uint32_t)(x) & PDGO_PCNT_CALIB_CFG_Z_SEL_MASK) >> PDGO_PCNT_CALIB_CFG_Z_SEL_SHIFT)

/*
 * B_SEL (RW)
 *
 * Select Input for Phase B：
 * 0：WUIO0
 * 1：WUIO1
 * 2：WUIO2
 * 3：WUIO3
 */
#define PDGO_PCNT_CALIB_CFG_B_SEL_MASK (0x30U)
#define PDGO_PCNT_CALIB_CFG_B_SEL_SHIFT (4U)
#define PDGO_PCNT_CALIB_CFG_B_SEL_SET(x) (((uint32_t)(x) << PDGO_PCNT_CALIB_CFG_B_SEL_SHIFT) & PDGO_PCNT_CALIB_CFG_B_SEL_MASK)
#define PDGO_PCNT_CALIB_CFG_B_SEL_GET(x) (((uint32_t)(x) & PDGO_PCNT_CALIB_CFG_B_SEL_MASK) >> PDGO_PCNT_CALIB_CFG_B_SEL_SHIFT)

/*
 * A_SEL (RW)
 *
 * Select Input for Phase A：
 * 0：WUIO0
 * 1：WUIO1
 * 2：WUIO2
 * 3：WUIO3
 */
#define PDGO_PCNT_CALIB_CFG_A_SEL_MASK (0x3U)
#define PDGO_PCNT_CALIB_CFG_A_SEL_SHIFT (0U)
#define PDGO_PCNT_CALIB_CFG_A_SEL_SET(x) (((uint32_t)(x) << PDGO_PCNT_CALIB_CFG_A_SEL_SHIFT) & PDGO_PCNT_CALIB_CFG_A_SEL_MASK)
#define PDGO_PCNT_CALIB_CFG_A_SEL_GET(x) (((uint32_t)(x) & PDGO_PCNT_CALIB_CFG_A_SEL_MASK) >> PDGO_PCNT_CALIB_CFG_A_SEL_SHIFT)

/* Bitfield definition for register of struct array PCNT: RESOLUTION */
/*
 * RESOLUTION (RW)
 *
 * Resolution Value
 * Note：The Field in this register is the same as COUNTER register, so if target resolution value is TARGET_LINES , it should be shifted according to the current DECODE_MODE, and then decrease 1 because it counts from 0, it means when:
 * MODE_AB_4X: RESOLUTION = (TARGET_LINES << 2) - 1;
 * MODE_AB_2X: RESOLUTION = (TARGET_LINES << 1) - 1;
 * MODE_AB_1X: RESOLUTION = (TARGET_LINES << 0) - 1;
 * MODE_PD_1X: RESOLUTION = (TARGET_LINES << 0) - 1;
 * MODE_PDF1X: RESOLUTION = (TARGET_LINES << 0) - 1;
 * MODE_PD_2X: RESOLUTION = (TARGET_LINES << 1) - 1;
 * MODE_PDF2X: RESOLUTION = (TARGET_LINES << 1) - 1;
 * MODE_UD_1X: RESOLUTION = (TARGET_LINES << 0) - 1;
 * MODE_UDF1X: RESOLUTION = (TARGET_LINES << 0) - 1;
 * MODE_UD_2X: RESOLUTION = (TARGET_LINES << 1) - 1;
 * MODE_UDF2X: RESOLUTION = (TARGET_LINES << 1) - 1;
 * MODE_UVW6X: RESOLUTION = (TARGET_LINES << 3) - 1;
 * MODE_UVW6Y: RESOLUTION = (TARGET_LINES << 3) - 1;
 */
#define PDGO_PCNT_RESOLUTION_RESOLUTION_MASK (0xFFFFFFFFUL)
#define PDGO_PCNT_RESOLUTION_RESOLUTION_SHIFT (0U)
#define PDGO_PCNT_RESOLUTION_RESOLUTION_SET(x) (((uint32_t)(x) << PDGO_PCNT_RESOLUTION_RESOLUTION_SHIFT) & PDGO_PCNT_RESOLUTION_RESOLUTION_MASK)
#define PDGO_PCNT_RESOLUTION_RESOLUTION_GET(x) (((uint32_t)(x) & PDGO_PCNT_RESOLUTION_RESOLUTION_MASK) >> PDGO_PCNT_RESOLUTION_RESOLUTION_SHIFT)

/* Bitfield definition for register of struct array PCNT: HOMING_CFG */
/*
 * RNG_CMP_SRC (RW)
 *
 * Select Compare Source for Comparator 0 in Range Match mode ( Mode1 )：
 * 0: Compare value from counter (Line+Phase), compare when counter updates
 * 1: Compare value from counter (Revolution+Line+Phase),  compare when counter updates
 * 2: Compare value from tacho_line(16bits), compare after each tacho
 * 3: Compare value from tacho_time(16bits), compare after each tacho
 */
#define PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_MASK (0x300000UL)
#define PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_SHIFT (20U)
#define PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_SET(x) (((uint32_t)(x) << PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_SHIFT) & PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_MASK)
#define PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_GET(x) (((uint32_t)(x) & PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_MASK) >> PDGO_PCNT_HOMING_CFG_RNG_CMP_SRC_SHIFT)

/*
 * MATCH0_MODE (RW)
 *
 * Match Mode for Match0:
 * Mode0 : Disable.
 * Mode1 : Range Match:
 * If  CMP0 <= CMP1, match valid when CMP0 <= RNG_CMP_SRC <= CMP1;
 * If CMP0 > CMP1, match valid when CMP0 <= RNG_CMP_SRC or RNG_CMP_SRC <= CMP1;
 * Note: The interrupt will be only available when entry and exit compare, i.e., it is generated only twice, but you can check whether it matches or not through the status bit in register.
 * Mode2 : when the COUNTER value matches the CMP0;
 * Mode3 : when the COUNTER value matches the CMP0; and the direction update value should be the same as the current direction;
 * Mode4: when counting up, the COUNTER value matches the CMP0;
 * Mode5: when counting up, the COUNTER value matches the CMP0; and the direction update value should be the same as the current direction;
 * Mode6: when counting down, the COUNTER value matches the CMP0;
 * Mode7: when counting down, the COUNTER value matches the CMP0; and the direction update value should be the same as the current direction;
 * Direction update value: direction decoded by the decoder according to the Phase (e.g. Phase 0 -> 1 -> 2 -> 3 -> 4 -> 5 -> 0 ...... mean forward.
 * Current Direction: direction decoded by the comparator based on the line field in counter.
 */
#define PDGO_PCNT_HOMING_CFG_MATCH0_MODE_MASK (0x70000UL)
#define PDGO_PCNT_HOMING_CFG_MATCH0_MODE_SHIFT (16U)
#define PDGO_PCNT_HOMING_CFG_MATCH0_MODE_SET(x) (((uint32_t)(x) << PDGO_PCNT_HOMING_CFG_MATCH0_MODE_SHIFT) & PDGO_PCNT_HOMING_CFG_MATCH0_MODE_MASK)
#define PDGO_PCNT_HOMING_CFG_MATCH0_MODE_GET(x) (((uint32_t)(x) & PDGO_PCNT_HOMING_CFG_MATCH0_MODE_MASK) >> PDGO_PCNT_HOMING_CFG_MATCH0_MODE_SHIFT)

/*
 * DMODE (RW)
 *
 * Dump Mode Selection
 * 0：Disable
 * 1：Edge Mode(Use Edge in DSTATE Register)
 * 2：Level Mode(Match Phase A,B and H)
 * 3：Level Mode(Only Match Phase H)
 */
#define PDGO_PCNT_HOMING_CFG_DMODE_MASK (0x3000U)
#define PDGO_PCNT_HOMING_CFG_DMODE_SHIFT (12U)
#define PDGO_PCNT_HOMING_CFG_DMODE_SET(x) (((uint32_t)(x) << PDGO_PCNT_HOMING_CFG_DMODE_SHIFT) & PDGO_PCNT_HOMING_CFG_DMODE_MASK)
#define PDGO_PCNT_HOMING_CFG_DMODE_GET(x) (((uint32_t)(x) & PDGO_PCNT_HOMING_CFG_DMODE_MASK) >> PDGO_PCNT_HOMING_CFG_DMODE_SHIFT)

