hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * DSTATE (RW)
 *
 * Dump Match State
 * When level mode:
 * The remaining bits correspond to the level state of the HZBA phase, respectively.
 * When edge mode:
 * Bit3: H-phase rising edge, reverse
 * Bit2: H-phase falling edge, forward
 * Bit1: H-phase falling edge, reverse
 * Bit0: H-phase rising edge, forward.
 */
#define PDGO_PCNT_HOMING_CFG_DSTATE_MASK (0xF00U)
#define PDGO_PCNT_HOMING_CFG_DSTATE_SHIFT (8U)
#define PDGO_PCNT_HOMING_CFG_DSTATE_SET(x) (((uint32_t)(x) << PDGO_PCNT_HOMING_CFG_DSTATE_SHIFT) & PDGO_PCNT_HOMING_CFG_DSTATE_MASK)
#define PDGO_PCNT_HOMING_CFG_DSTATE_GET(x) (((uint32_t)(x) & PDGO_PCNT_HOMING_CFG_DSTATE_MASK) >> PDGO_PCNT_HOMING_CFG_DSTATE_SHIFT)

/*
 * HMODE (RW)
 *
 * Phase H Mode Selection
 * 0：Disable
 * 1：Edge Mode(Use Edge in HSTATE Register)
 * 2：Level Mode(Match Phase A,B and H)
 * 3：Level Mode(Only Match Phase H)
 */
#define PDGO_PCNT_HOMING_CFG_HMODE_MASK (0x30U)
#define PDGO_PCNT_HOMING_CFG_HMODE_SHIFT (4U)
#define PDGO_PCNT_HOMING_CFG_HMODE_SET(x) (((uint32_t)(x) << PDGO_PCNT_HOMING_CFG_HMODE_SHIFT) & PDGO_PCNT_HOMING_CFG_HMODE_MASK)
#define PDGO_PCNT_HOMING_CFG_HMODE_GET(x) (((uint32_t)(x) & PDGO_PCNT_HOMING_CFG_HMODE_MASK) >> PDGO_PCNT_HOMING_CFG_HMODE_SHIFT)

/*
 * HSTATE (RW)
 *
 * H-Phase Match State
 * When level mode:
 * Each bit correspond to the level state of the HZBA phase, respectively.
 * When edge mode:
 * If bit3 is 1: Match H-phase rising edge, reverse
 * If bit2 is 1: Match H-phase falling edge, forward
 * If bit1 is 1: Match H-phase falling edge, reverse
 * If bit0 is 1: Match H-phase rising edge, forward.
 */
#define PDGO_PCNT_HOMING_CFG_HSTATE_MASK (0xFU)
#define PDGO_PCNT_HOMING_CFG_HSTATE_SHIFT (0U)
#define PDGO_PCNT_HOMING_CFG_HSTATE_SET(x) (((uint32_t)(x) << PDGO_PCNT_HOMING_CFG_HSTATE_SHIFT) & PDGO_PCNT_HOMING_CFG_HSTATE_MASK)
#define PDGO_PCNT_HOMING_CFG_HSTATE_GET(x) (((uint32_t)(x) & PDGO_PCNT_HOMING_CFG_HSTATE_MASK) >> PDGO_PCNT_HOMING_CFG_HSTATE_SHIFT)

/* Bitfield definition for register of struct array PCNT: ANALYSE_CFG */
/*
 * ERS (RW)
 *
 * Whether to discard this result and automatically restart the tacho immediately after a Dec_Error or Seq_Error is detected.
 */
#define PDGO_PCNT_ANALYSE_CFG_ERS_MASK (0x40000UL)
#define PDGO_PCNT_ANALYSE_CFG_ERS_SHIFT (18U)
#define PDGO_PCNT_ANALYSE_CFG_ERS_SET(x) (((uint32_t)(x) << PDGO_PCNT_ANALYSE_CFG_ERS_SHIFT) & PDGO_PCNT_ANALYSE_CFG_ERS_MASK)
#define PDGO_PCNT_ANALYSE_CFG_ERS_GET(x) (((uint32_t)(x) & PDGO_PCNT_ANALYSE_CFG_ERS_MASK) >> PDGO_PCNT_ANALYSE_CFG_ERS_SHIFT)

/*
 * TACHO_MODE (RW)
 *
 * Tacho Mode Selection
 * 0: Disable tacho
 * 1: Period Mode, specify the length of time, measure the number of complete lines traveled within the length of time, and record the actual time spent.
 * 2: Travel Mode, specify the number of lines, measure the time taken to reach the number of lines.
 */
#define PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_MASK (0x30000UL)
#define PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_SHIFT (16U)
#define PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_SET(x) (((uint32_t)(x) << PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_SHIFT) & PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_MASK)
#define PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_GET(x) (((uint32_t)(x) & PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_MASK) >> PDGO_PCNT_ANALYSE_CFG_TACHO_MODE_SHIFT)

/*
 * TACHO_LEN (RW)
 *
 * Tacho Length
 * Period Mode：specify the length of time for each tacho.
 * Travel  Mode：specify the number of lines for each tacho.
 * Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.
 */
#define PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_MASK (0xFFFFU)
#define PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_SHIFT (0U)
#define PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_SET(x) (((uint32_t)(x) << PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_SHIFT) & PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_MASK)
#define PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_GET(x) (((uint32_t)(x) & PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_MASK) >> PDGO_PCNT_ANALYSE_CFG_TACHO_LEN_SHIFT)

/* Bitfield definition for register of struct array PCNT: DIRECTION */
/*
 * DIR (RW)
 *
 * Software Override Direction Value
 * 0： Forward
 * 1： Reverse
 */
#define PDGO_PCNT_DIRECTION_DIR_MASK (0x1U)
#define PDGO_PCNT_DIRECTION_DIR_SHIFT (0U)
#define PDGO_PCNT_DIRECTION_DIR_SET(x) (((uint32_t)(x) << PDGO_PCNT_DIRECTION_DIR_SHIFT) & PDGO_PCNT_DIRECTION_DIR_MASK)
#define PDGO_PCNT_DIRECTION_DIR_GET(x) (((uint32_t)(x) & PDGO_PCNT_DIRECTION_DIR_MASK) >> PDGO_PCNT_DIRECTION_DIR_SHIFT)

/* Bitfield definition for register of struct array PCNT: CMP0 */
/*
 * CMP0 (RW)
 *
 * Comnpare Point 0
 * Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.
 */
#define PDGO_PCNT_CMP0_CMP0_MASK (0xFFFFFFFFUL)
#define PDGO_PCNT_CMP0_CMP0_SHIFT (0U)
#define PDGO_PCNT_CMP0_CMP0_SET(x) (((uint32_t)(x) << PDGO_PCNT_CMP0_CMP0_SHIFT) & PDGO_PCNT_CMP0_CMP0_MASK)
#define PDGO_PCNT_CMP0_CMP0_GET(x) (((uint32_t)(x) & PDGO_PCNT_CMP0_CMP0_MASK) >> PDGO_PCNT_CMP0_CMP0_SHIFT)

/* Bitfield definition for register of struct array PCNT: CMP1 */
/*
 * CMP1 (RW)
 *
 * Comnpare Point 1
 * Note: This is a SYNC register, and it won't be valid immediately after change. It can be change only after last configuration valid.
 */
#define PDGO_PCNT_CMP1_CMP1_MASK (0xFFFFFFFFUL)
#define PDGO_PCNT_CMP1_CMP1_SHIFT (0U)
#define PDGO_PCNT_CMP1_CMP1_SET(x) (((uint32_t)(x) << PDGO_PCNT_CMP1_CMP1_SHIFT) & PDGO_PCNT_CMP1_CMP1_MASK)
#define PDGO_PCNT_CMP1_CMP1_GET(x) (((uint32_t)(x) & PDGO_PCNT_CMP1_CMP1_MASK) >> PDGO_PCNT_CMP1_CMP1_SHIFT)

/* Bitfield definition for register of struct array PCNT: CNT */
/*
 * COUNTER (RW)
 *
 * Pulse Counter Value
 * Note:
 * 1. Pulse Counter Value update when:
 * - Software Update: According to the current DECODE_MODE, the software directly writes the target value to the Revolution field and Line field of this register;
 * - Phase Z (Index) match: When Phase Z matches, clear Line field; Revolution field will be increased by 1 if forward, Revolution field remains unchanged if reverse, and the Phase field will be updated by decoder.
 * - Phase H (Home) match: when Phase H matches, clear Revolution field; and the Line field and Phase field will be updated by decoder.
 * - Decoder update: Revolution field, Line field and Phase field will be updated by decoder.
 * 2. This is a SYNC register, and it won't be valid immediately after software write. It can be change only after last configuration valid.
 * 3. Pulse Counter Value include：
 * - Revolution field;
 * - Line field，the width of this bit field depends on RESOLUTION register;
 * - Phase field，the width of this bit field depends on DECODE_MODE register, when:
 * ·  MODE_AB_4X: 2 Bits，Bit[1:0];
 * ·  MODE_AB_2X: 1 Bit，Bit[0];
 * ·  MODE_AB_1X: 0 Bit，no Phase field;
 * ·  MODE_PD_1X: 0 Bit，no Phase field;
 * ·  MODE_PDF1X: 0 Bit，no Phase field;
 * ·  MODE_PD_2X: 1 Bit，Bit[0]；
 * ·  MODE_PDF2X: 1 Bit，Bit[0];
 * ·  MODE_UD_1X: 0 Bit，no Phase field;
 * ·  MODE_UDF1X: 0 Bit，no Phase field;
 * ·  MODE_UD_2X: 1 Bit，Bit[0];
 * ·  MODE_UDF2X: 1 Bit，Bit[0];
 * ·  MODE_UVW6X: 3 Bits，Bit[2:0];
 * ·  MODE_UVW6Y: 3 Bits，Bit[2:0];
 */
#define PDGO_PCNT_CNT_COUNTER_MASK (0xFFFFFFFFUL)
#define PDGO_PCNT_CNT_COUNTER_SHIFT (0U)
#define PDGO_PCNT_CNT_COUNTER_SET(x) (((uint32_t)(x) << PDGO_PCNT_CNT_COUNTER_SHIFT) & PDGO_PCNT_CNT_COUNTER_MASK)
#define PDGO_PCNT_CNT_COUNTER_GET(x) (((uint32_t)(x) & PDGO_PCNT_CNT_COUNTER_MASK) >> PDGO_PCNT_CNT_COUNTER_SHIFT)

/* Bitfield definition for register of struct array PCNT: TACHO */
/*
 * LINE (RW)
 *
 * Line Result
 * Period Mode：count up from 0 when forward; count down from 0 when forward.
 * Travel  Mode：count up from 0 when forward; count down from 0xFFFF when forward.
 */
#define PDGO_PCNT_TACHO_LINE_MASK (0xFFFF0000UL)
#define PDGO_PCNT_TACHO_LINE_SHIFT (16U)
#define PDGO_PCNT_TACHO_LINE_SET(x) (((uint32_t)(x) << PDGO_PCNT_TACHO_LINE_SHIFT) & PDGO_PCNT_TACHO_LINE_MASK)
#define PDGO_PCNT_TACHO_LINE_GET(x) (((uint32_t)(x) & PDGO_PCNT_TACHO_LINE_MASK) >> PDGO_PCNT_TACHO_LINE_SHIFT)

