hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pdgo_regs.h
/*
 * TIME (RW)
 *
 * Time Result
 * Period Mode: The actual time taken to complete the complete Lines in a specified time.
 * Travel Mode: The actual time taken to complete the specified Lines.
 */
#define PDGO_PCNT_TACHO_TIME_MASK (0xFFFFU)
#define PDGO_PCNT_TACHO_TIME_SHIFT (0U)
#define PDGO_PCNT_TACHO_TIME_SET(x) (((uint32_t)(x) << PDGO_PCNT_TACHO_TIME_SHIFT) & PDGO_PCNT_TACHO_TIME_MASK)
#define PDGO_PCNT_TACHO_TIME_GET(x) (((uint32_t)(x) & PDGO_PCNT_TACHO_TIME_MASK) >> PDGO_PCNT_TACHO_TIME_SHIFT)

/* Bitfield definition for register of struct array PCNT: DUMP */
/*
 * DUMP (RO)
 *
 * Dump Result:  Save COUNTER value when DUMP match.
 */
#define PDGO_PCNT_DUMP_DUMP_MASK (0xFFFFFFFFUL)
#define PDGO_PCNT_DUMP_DUMP_SHIFT (0U)
#define PDGO_PCNT_DUMP_DUMP_GET(x) (((uint32_t)(x) & PDGO_PCNT_DUMP_DUMP_MASK) >> PDGO_PCNT_DUMP_DUMP_SHIFT)

/* Bitfield definition for register of struct array PCNT: STS */
/*
 * MATCH0 (RO)
 *
 * MATCH0 Status
 * 0:invalid
 * 1:valid
 */
#define PDGO_PCNT_STS_MATCH0_MASK (0x1U)
#define PDGO_PCNT_STS_MATCH0_SHIFT (0U)
#define PDGO_PCNT_STS_MATCH0_GET(x) (((uint32_t)(x) & PDGO_PCNT_STS_MATCH0_MASK) >> PDGO_PCNT_STS_MATCH0_SHIFT)



/* GPR register group index macro definition */
#define PDGO_GPR_0 (0UL)
#define PDGO_GPR_1 (1UL)
#define PDGO_GPR_2 (2UL)
#define PDGO_GPR_3 (3UL)
#define PDGO_GPR_4 (4UL)
#define PDGO_GPR_5 (5UL)
#define PDGO_GPR_6 (6UL)
#define PDGO_GPR_7 (7UL)

/* IOFILTER register group index macro definition */
#define PDGO_IOFILTER_0 (0UL)
#define PDGO_IOFILTER_1 (1UL)
#define PDGO_IOFILTER_2 (2UL)
#define PDGO_IOFILTER_3 (3UL)

/* PCAP register group index macro definition */
#define PDGO_PCAP_0 (0UL)

/* PCNT register group index macro definition */
#define PDGO_PCNT_0 (0UL)


#endif /* HPM_PDGO_H */
